import Mock from 'mockjs';
import axios from 'axios';

//Mock.mock是Mock的方法 第一个参数是自定义接口（url）后面的对象是自定义配置的数据
// const Random = Mock.Random;
export default Mock.mock('/api',{
    'seller': {
        'name|1' : [
            '开心超市',
            '大良百货',
            '永生超市',
            '鲜果园',
            '苏果园'
        ],
        //属性 age 的值是一个数组,其中包含1-100 个元素
        //'id|+1':1    属性id是一个自增数 ，起始值为1，每次增加1
        'description': '美团专车',
        'avatar|1': [
            'http://cangdu.org:8001/img/16131b317533592.png',
            'http://cangdu.org:8001/img/1613ac5ba6b3660.jpg',
            
        ],
        'deliveryTime|30-100': 38,
        'score|1-5': 4.5,
        'foodScore|1-5': 4.5,//商品得分
        'rankRate|1-100': 22.22,//高于商家百分之多少
        'serviceScore|3-5': 4.1,//服务得分
        "deliveryPrice|1-10": 6,//配送费
        'minPrice|1-10': 8,//最小起送费
        'sellCount|1-100': 90,//销售量
        'ratingCount|1-100': 20,
        'notice|1': [
            '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
            '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
            '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
            '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'            
        ],
        'supports': [
            {
                'type': 0,
                'description': '7折优惠' 
            },
            {
                'type': 1,
                'description': '新出单身狗套餐' 
            },
            {
                'type': 2,
                'description': '该商家支持发票' 
            },
            {
                'type': 3,
                'description': '有女朋友的享受5折优惠' 
            },
            {
                'type': 4,
                'description': '满90减1块钱' 
            },
        ],
        'rathings|1-30': [
            {
                'username': '@name',
                'rateTime|1000000000000-9000000000000': 1469271264000,
                'deliveryTime|20-50': 20,
                'score|1-5': 5,
                'time': '2011-10-11',
                'data': '22:11',
                'text|1': [
                    '好吃特别好吃不知道有多好吃',
                    '',
                    '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                    '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                    '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                ],
                'sad|1': [
                    '不好吃',
                    '好难吃',                                
                ],
                'recommend|3': [
                    {
                        'id|+1':[
                            '可乐',
                            '雪碧',
                            '乐事薯片',
                            '养乐多',
                            '黑山羊肉串',
                            '每日坚果',
                            '步步为赢辣条'
                        ]
                    }
                ] ,
                'rateType|0-1': 0,
                'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
            }
        ]        
    },
    'goods': [
        {
            'name': '热销榜',
            'type': '-1',
            'foods|1-10': [
                {
                    'name|1': [
                        '可乐',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-100': 100,
                    'oldPrive|100-200': 150,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|80-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    'rathings|3-100': [
                        {
                            'username': '@name',
                            'rateTime|1000000000000-9000000000000': 1469271264000,
                            'text|1': [
                                '好吃特别好吃不知道有多好吃',
                                '',
                                '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                                '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                                '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                            ],
                            'sad|1': [
                                '不好吃',
                                '好难吃',                                
                            ],
                            'time': '2009-01-22',
                            'rateType|0-1': 0,
                            'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                        }
                    ],
                    'icon': '',
                    'image': '图片'
                }
            ]
        },
        {
            'name': '单品特价',
            'type': '2',
            'foods|10': [
                {
                    'name|1': [
                        '可乐',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-9': 100,
                    'oldPrive|100-200': 50,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|1-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    // 'rathings|0': [
                    //     {
                    //         'username': '@name',
                    //         'rateTime|1000000000000-9000000000000': 1469271264000,
                    //         'text|1': [
                    //             '好吃特别好吃不知道有多好吃',
                    //             '',
                    //             '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                    //             '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                    //             '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                    //         ],
                    //         'sad|1': [
                    //             '不好吃',
                    //             '好难吃',                                
                    //         ],
                    //         'rateType|0-1': 0,
                    //         'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                    //     }
                    // ],
                    'icon': '',
                    'image': ''
                }
            ]
        },
        {
            'name': '精选零食',
            'type': '-1',
            'foods|10': [
                {
                    'name|1': [
                        '可乐',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-100': 100,
                    'oldPrive|1-100': 50,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|1-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    'rathings|3-100': [
                        {
                            'username': '@name',
                            'rateTime|1000000000000-9000000000000': 1469271264000,
                            'text|1': [
                                '好吃特别好吃不知道有多好吃',
                                '',
                                '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                                '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                                '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                            ],
                            'sad|1': [
                                '不好吃',
                                '好难吃',                                
                            ],
                            'rateType|0-1': 0,
                            'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                        }
                    ],
                    'icon': '',
                    'image': ''
                }
            ]
        },
        {
            'name': '冰爽饮品限时特惠',
            'type': '1',
            'foods|10': [
                {
                    'name|1': [
                        '可乐',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-100': 100,
                    'oldPrive|1-100': 50,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|1-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    'rathings|3-100': [
                        {
                            'username': '@name',
                            'rateTime|1000000000000-9000000000000': 1469271264000,
                            'text|1': [
                                '好吃特别好吃不知道有多好吃',
                                '',
                                '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                                '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                                '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                            ],
                            'sad|1': [
                                '不好吃',
                                '好难吃',                                
                            ],
                            'rateType|0-1': 0,
                            'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                        }
                    ],
                    'icon': '',
                    'image': ''
                }
            ]
        },
        {
            'name': '爽口零食',
            'type': '-1',
            'foods|10': [
                {
                    'name|1': [
                        '可乐',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-100': 100,
                    'oldPrive|1-100': 50,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|1-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    'rathings|3-100': [
                        {
                            'username': '@name',
                            'rateTime|1000000000000-9000000000000': 1469271264000,
                            'text|1': [
                                '好吃特别好吃不知道有多好吃',
                                '',
                                '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                                '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                                '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                            ],
                            'sad|1': [
                                '不好吃',
                                '好难吃',                                
                            ],
                            'rateType|0-1': 0,
                            'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                        }
                    ],
                    'icon': '',
                    'image': ''
                }
            ]
        },
        {
            'name': '特价零食套餐',
            'type': '-1',
            'foods|10': [
                {
                    'name|1': [
                        '可乐',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-100': 100,
                    'oldPrive|1-100': 50,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|1-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    'rathings|3-100': [
                        {
                            'username': '@name',
                            'rateTime|1000000000000-9000000000000': 1469271264000,
                            'text|1': [
                                '好吃特别好吃不知道有多好吃',
                                '',
                                '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                                '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                                '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                            ],
                            'sad|1': [
                                '不好吃',
                                '好难吃',                                
                            ],
                            'rateType|0-1': 0,
                            'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                        }
                    ],
                    'icon': '',
                    'image': ''
                }
            ]
        },
        {
            'name': '果品果汁',
            'type': '-1',
            'foods|10': [
                {
                    'name|1': [
                        '蜜瓜圣女萝莉杯',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-100': 100,
                    'oldPrive|1-100': 50,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|1-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    'rathings|3-100': [
                        {
                            'username': '@name',
                            'rateTime|1000000000000-9000000000000': 1469271264000,
                            'text|1': [
                                '好吃特别好吃不知道有多好吃',
                                '',
                                '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                                '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                                '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                            ],
                            'sad|1': [
                                '不好吃',
                                '好难吃',                                
                            ],
                            'rateType|0-1': 0,
                            'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                        }
                    ],
                    'icon': '',
                    'image': ''
                }
            ]
        },
        {
            'name': '小吃零食主食',
            'type': '-1',
            'foods|10': [
                {
                    'name|1': [
                        '可乐',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-100': 100,
                    'oldPrive|1-100': 50,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|1-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    'rathings|3-100': [
                        {
                            'username': '@name',
                            'rateTime|1000000000000-9000000000000': 1469271264000,
                            'text|1': [
                                '好吃特别好吃不知道有多好吃',
                                '',
                                '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                                '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                                '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                            ],
                            'sad|1': [
                                '不好吃',
                                '好难吃',                                
                            ],
                            'rateType|0-1': 0,
                            'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                        }
                    ],
                    'icon': '',
                    'image': ''
                }
            ]
        },
        {
            'name': '日常用品',
            'type': '-1',
            'foods|10': [
                {
                    'name|1': [
                        '可乐',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',                        
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ],
                    'price|1-100': 100,
                    'oldPrive|1-100': 50,
                    'decription|1': [
                        'k',
                        '雪碧',
                        '乐事薯片',
                        '养乐多',
                        '步步为赢辣条',
                        '手撕面包',
                        '手工寿司',
                        '每日坚果',
                        '黑山羊肉串'
                    ], 
                    'sellCount|1-100': 99,
                    'reting|1-100': 100,
                    'info|1': [
                        '生鲜经营是永辉最大的特色：永辉各门店的生鲜经营面积都达到40%以上，而且果、蔬、禽、肉、蛋、鱼等品种一应俱全；在集团总销售额中，生鲜农副产品的销售额占到总销售额50%以上。永辉的生鲜经营之所以有强大的竞争力，首先源于其在商品陈列、气氛营造方面体现出的专业素质，在肉品分割上，一般超市是分割好了，等着顾客来买。永辉则是现场分割，顾客要哪块就给切哪块，真正满足了顾客的餐桌需求。',
                        '通过如此集中管理和陈列，永辉生鲜产品的损耗最低可控制在3%左右，而许多超市甚至会达到20%。损耗的减少在帮助永辉以更便宜的价格回馈消费者的同时，也使得永辉经营生鲜商品的毛利提高。',
                        '永辉确立了采购的品种优势和对抗农贸市场的价格优势。当马路市场中的西瓜还是1元的时候，永辉门店中的西瓜却可以以0.12元的价格进行大量促销。',
                        '永辉在采购海鲜商品时，会直接把采购船开到海中渔船的旁边，实现直接采购，这也是永辉在水产商品经营中罕有对手的原因'
                    ],
                    'rathings|3-100': [
                        {
                            'username': '@name',
                            'rateTime|1000000000000-9000000000000': 1469271264000,
                            'text|1': [
                                '好吃特别好吃不知道有多好吃',
                                '',
                                '第二次来买了，货比我想像中要好！！老板人表扬下。。',
                                '包装看起来很好，包得很用心，相信货一定很好，谢谢了！',
                                '货超值，呵，下次再来。帮你做个广告，朋友们：这家店的货值'
                            ],
                            'sad|1': [
                                '不好吃',
                                '好难吃',                                
                            ],
                            'rateType|0-1': 0,
                            'avartar': 'https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=12867320,655225767&fm=27&gp=0.jpg' 
                        }
                    ],
                    'icon': '',
                    'image': ''
                }
            ]
        }
    ],
  
});





